{
  "2025-2-21": [
    [
      "2025-02-21 12:13PM",
      "Legendary former Penn men’s basketball coach Fran Dunphy set to retire"
    ]
  ],
  "2025-2-22": [
    [
      "2025-02-22 05:19AM",
      "Legendary former Penn men’s basketball coach Fran Dunphy set to retire"
    ],
    [
      "2025-02-22 03:19PM",
      "Hurrah, hurrah: Penn men’s basketball snaps five-game losing streak with win over Dartmouth"
    ]
  ],
  "2025-2-23": [
    [
      "2025-02-23 05:19AM",
      "Penn men’s basketball eliminated from Ivy League tournament contention following 79-78 loss to Harvard"
    ]
  ],
  "2025-2-24": [
    [
      "2025-02-24 05:22AM",
      "Seven goals from Brandt not enough as No. 12 Penn women’s lacrosse falls to No. 10 Johns Hopkins"
    ]
  ],
  "2025-2-25": [
    [
      "2025-02-25 05:21AM",
      "Penn baseball’s Sebastian Haggard wins season’s first Ivy Rookie of the Week"
    ]
  ],
  "2025-2-26": [
    [
      "2025-02-26 05:21AM",
      "Resilience fuels Penn men’s swimming and diving for Ivy League Championships"
    ],
    [
      "2025-02-26 03:22PM",
      "From Bears to Quakers: Michael Zanoni’s basketball career has been no small feat"
    ]
  ],
  "2025-2-27": [
    [
      "2025-02-27 05:21AM",
      "Same sport, different game: The nuances of indoor vs. outdoor track and field"
    ]
  ],
  "2025-2-28": [
    [
      "2025-02-28 05:21AM",
      "Anna Brandt breaks all-time goal record in a dominant win over Temple for Penn women's lacrosse"
    ]
  ],
  "2025-3-1": [
    [
      "2025-03-01 05:19AM",
      "Penn women’s basketball dominates Dartmouth, nears Ivy League Tournament berth"
    ]
  ],
  "2025-3-2": [
    [
      "2025-03-02 05:19AM",
      "Dominant Harvard defense puts Penn women’s basketball's hopes for Ivy Madness in jeopardy"
    ]
  ],
  "2025-3-3": [
    [
      "2025-03-03 05:22AM",
      "Matt Fallon notches nation-leading time in the 200-yard breaststroke at Ivy League Championships "
    ],
    [
      "2025-03-03 03:22PM",
      "Penn baseball's senior pitcher Will Tobin has one last rodeo"
    ]
  ],
  "2025-3-4": [
    [
      "2025-03-04 05:22AM",
      "Penn baseball's senior pitcher Will Tobin has one last rodeo"
    ]
  ],
  "2025-3-5": [
    [
      "2025-03-05 05:22AM",
      "Penn men’s basketball’s two New York games offer glimpses of season at-large"
    ],
    [
      "2025-03-05 03:22PM",
      "Lee | Penn men’s basketball’s two New York games offer glimpses of season at-large"
    ]
  ],
  "2025-3-6": [
    [
      "2025-03-06 05:22AM",
      "Penn gymnastics earns perfect record against Ivy League competitors"
    ],
    [
      "2025-03-06 03:22PM",
      "Agent Zero: Freshman guard AJ Levine is the one to watch"
    ]
  ]
}